Tekla Open API Reference for Tekla Structures 2025
Weld.WeldAttributes Class
 The WeldAttributes class is the attributes class for the weld.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.AttributesBase
 Tekla.Structures.Drawing.Weld.WeldAttributes
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class WeldAttributes : AttributesBase
<SerializableAttribute>
Public NotInheritable Class WeldAttributes
	Inherits AttributesBase
The Weld.WeldAttributes type exposes the following members.
Constructors
Name | Description
Weld.WeldAttributes()
 Creates a new default weld attributes instance that loads standard attributes.
Weld.WeldAttributes(String)
 Creates a new weld attributes instance that loads the specified attributes.
Top
Properties
Name | Description
CustomPresentation
 Custom presentation GUID to be applied to the weld
DrawHiddenLines
 True if hidden lines are drawn.
DrawOwnHiddenLines
 True if own hidden lines are drawn.
HiddenLines
 The line type of hidden lines.
Representation
 The representation of the weld.
VisibleLines
 The line type of visible lines.
Top
Methods
Name | Description
IsEqual
 Compares the current object with an object of the same type.
 (Overrides AttributesBase.IsEqual(Object).)
LoadAttributes
 Loads the attributes from the attribute file.
 (Overrides AttributesBase.LoadAttributes(String).)
Top
See Also
Reference
Tekla.Structures.Drawing Namespace